Информационная_база/src/Catalogs/ЛБТ_ЗадачиАвтоматизации/ЛБТ_ЗадачиАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛБТ_ЗадачиАвтоматизации</name>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ЛБТ_НазванияТиповЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональныйБлок</name>
    <type>
      <types>CatalogRef.ЛБТ_ФункциональныеБлоки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацииСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Типовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.ЛБТ_Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Информационная_база/src/Catalogs/ЛБТ_ЗадачиАвтоматизации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыПодбора = Новый Структура;
	//ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	//ОткрытьФорму("Справочник.ЛБТ_Конфигурации.ФормаВыбора", ПараметрыПодбора, Элементы.Конфигурации);
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КонфигурацииОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура КонфигурацииОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Для Каждого стр Из ВыбранноеЗначение Цикл
		нстр=объект.Конфигурации.Добавить(стр);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Конфигурации.Количество() > 0 Тогда
		ТекущийОбъект.Конфигурации.Очистить();
		Для каждого стр из Конфигурации Цикл
			стрТЧ = ТекущийОбъект.Конфигурации.Добавить();
			стрТЧ.Конфигурация = стр.Значение;
		КонецЦикла;
		ТекущийОбъект.КонфигурацииСтрокой = Строка(Конфигурации);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Для каждого стр из Объект.Конфигурации Цикл
		Конфигурации.Добавить(стр.Конфигурация);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
